##

### 计费组
自我介绍
实习遇到的难题，如何解决
注册中心会遇到什么难点？
服务熔断和降级如何考虑和实现的？
如何应对服务假死的问题？
C语言和Go了解吗？
给了一个C语言结构体，计算多少字节
介绍一下动态规划和回溯？
1，3，5面值的硬币若干，用上面两种算法分别口述思路。
回溯能否进一步剪枝？
算法题：符串压缩，写完问有没有比O(n)还好的算法。
实习时间，多久可以到岗？


### unknow1
1. 自我介绍
2. Redis 用于做什么
3. Redis 集群结构，哨兵选举流程
4. Zookeeper 底层是否了解，Zookeeper 选举流程
5. 交卷和阅卷功能为什么要用消息队列或线程池，流程设计思想
6. 如果线程池或者消息队列挂掉，怎么保证一定阅卷
7. 如果线程池或消息队列挂掉，此时用户又发出大量的查询请求，怎么保证服务不被冲垮掉
8. 有没有关注什么开源框架


### unknown2
KV 存储如何容错
Raft leader 选举
Raft 如何高可用
LSM tree 原理
正则表达式 * 和 ？的区别
环形链表有什么用
堆排序原理，和冒泡排序空间效率区别
UDP 和 TCP 的应用场景

### unknown3
1.用位运算判断奇偶数2.一个整数对1024取模
3.任意的m对n取模，不能用除法和取模
运算符
求m除n，保留k位小数，返回字符串形式
5.z字形矩阵生成
海量数据当中如何对敏感词过滤


### unknow4
1.自我介绍
2.一个涉及加密解密的项目，深挖，加密怎么做的，密钥怎么存的，前后端都问了，如何保证密钥的安全，如何生成的密钥，前端如何做的，如何检测证书等等问题
3.现在有一台服务器，一个DB实例，两张表，A表扣100块钱，B表加100块钱，如何实现事务，聊天框写一下，第一次写没有判断B是否余额够，第二次写了一半被叫停时间不够了。
4.两张表在不同的DB实例，涉及分布式事务，用的什么语言，业务层怎么实现线程同步的，除了信号量还有什么，锁，那就实现一下吧，写一下简单的代码
5.了解docker和k8s吗，用过，不太熟悉。
6.docker如何处理资源隔离的
7.k8s pod是什么
8.k8s pod和docker的容器什么关系
9.linux用过吗，如何创建子进程，如何监听进程，命名管道和无名管道的区别